//#include <iostream>
//#include <math.h>
//#include <Windows.h>
//
//using namespace std;
//
//int main() {
////	SetConsoleOutputCP(1251);
////	SetConsoleCP(1251);
////	int x, y;
////	cout << "Введите координаты точки (x, y):\n";
////	cout << "x = ";
////	cin >> x;
////	cout << "\ny = ";
////	cin >> y;
////	if (x * x + y * y < 9 && y > 0)
////		cout << "Точка находится внутри заданной фигуры с диаметром 6";
////	else if(x * x + y * y > 9 || y < 0)
////		cout << "Точка находится снаружи заданной фигуры с диаметром 6";
////	else
////		cout << "Точка находится на границе заданной фигуры с диаметром 6";
////	return 0;
//
//	char op;
//	cout << "Сделай свой выбор, собери авто своей мечты: ";
//	cin >> op;
//	switch (op)
//	{
//	case 'S':
//		cout << "Радио играть должно\n";
//		/*cout << "Колёса круглые\n";
//		cout << "Мощный двигатель\n";
//		break;*/
//	case 'V':
//		cout << "Кондиционер хочу\n";
//		/*cout << "Радио должно играть\n";
//		cout << "Колёса круглые\n";
//		cout << "Мощный двигатель\n";
//		break;*/
//	default:
//		cout << "Колёса круглые\n";
//		cout << "Мощный двигатель\n";
//}
//
